Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>hkYJkJxif99w172nDxECZW9OUgjtYAtShLAsBxTLIgw3tzlPLpnH+UStfzS8Pae2d9wfuaqPgL8L&#13;
uNqtFGMgGL2kmrylarNgpR5vY7YK1SYl68jAOrHZNd0xcz65ge8lPXEnNLjcMnqNwtzul4QYE+VX&#13;
mm9xa8nfE1pKpQTVju/k0e5n+G0LPY+6cjAXDdgb7PxpsHBGY4vVudchimm4ccOIPF8sJ+/afTN1&#13;
bqpxJ1QnoureKCP3Cv7wS2NtGHK+0tFkTuzL/IDmaiEmObAAmCFy6JJ8ZRlzJ9onBIm3o84MIxXh&#13;
OVoCpwAMfCkrDTqnV2G+FWhwwciQiKrKTTuoxQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>/fXwmKV6k1pPb0/2wYE9gW2m6G5+yfxqdz5SsLpmDuW7CREGYuCtQfG9UTjBrL0ykobFEJRGit0e&#13;
LmqIDO8nuJ6BkGq3GjMFFnBuXfWFOMuBTH10Z1j3nA7t031jd47c3JpJAaou1dG/DQ3g2FyOkIK6&#13;
ivhMCpf/argc4OvisI+rO3CPgbQvLRsjZ8ho82kLFQZr72xRZghDbCladkY283QmDgPHs0lClWBi&#13;
z4T1beggvv+JyAhMHbi4hDi9R7hI0TohWZ4atD/Xf27woRZL8KArHqpq69EqUOXXdeb4tLl+IejD&#13;
N2vMAEU883aX19UXFGCK9sjj7b8fSX9D0vcd9JEj+SbEOWIy1adknaH6X4sWpgo2mb8UOHVREIxa&#13;
MpsEmuAcPLB9vcxwmtBpfVHxrrwe5SW3mlK3rDEvN3rWWD96gTZdP8R5I9X2sJ57oHDtkpMpVoPi&#13;
7Gq6S5v8tf7zxwGkvwLI8YGFDRkIMnv+P6wqwx7e4WEcc7+eGffEj1RYxOFLnp96Q7nCCVfjoVxO&#13;
lghODb0kolSntX8FnFA3YKL+cQQPcOSxMeOuBu2L/hR6JGs5F6HgltQLbMKhWD1qa8but8fynAYX&#13;
J3QDMx8virwanCK5qirST6oR3GIFxJHbHe1B8emjM5FTiD7FBv1u8jYFeoNffK0KPZK37LfyAu8J&#13;
g6HXmkWxqcvtCKnZpCCVs7/qDp1VaYQzM3kPiX/vcY6v1sBILSBr1zPjzb6WBXQk6mWXJpMnuLGX&#13;
GS3oYxIYqtZV1/ws7TA+h6Dh/V8sKpuXtQmspz8JRpGQrrC2yMrr5kgMTCDupnwlXbaMHwJ+k36i&#13;
1dR+GxQr6LJ92qzJuobEYYDmX3BJhrBPK0lrQT9MFyTnHwM7bbzXiHk/W3ZB3L3LjZjkbL4kKsVp&#13;
z/0B2GtYcr5UVqdrASbUkVgsTiR9/dSja++RpBi1K1OdbUsC</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>23JCOvFEnKGUYHVZwKxc86lnLcE=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
i/QYol2WOmmNhLo0GrCFvtWcqzGrenfg3szglLQhkn84YCza+hvDw4BE3t5ohzyZLqH3M20jhzAE&#13;
k7cSL/z0w8+WpcICtki3ZbldGQqukolz8nAC6nNP5jYYu5oJja/pZ7sThDWvw7IE/yYDNHNt8KMp&#13;
K0mJehBOFZU4O7OjwwdEjuMTAxmM92BQwcHV7BmiNFlBVvoMazXc4FaZnwr5HPSHJrFCiodTjmla&#13;
SkLVXCIyQwZ/VbJ5owa+rZ7n52GEBNfHMqXYPqaO146RpGr8szd5RgOADX7T5Y3NGErdQDk4DO8c&#13;
bYZy5X1H7T6fseTKXGYumZ+doWZ5s4dkHeTisg==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>